In [ ]:
# 2 - Crie o seguinte Dataframe: (IMAGEM)
#   a) Realize novas inserções;
#   b) Apresente o resultado;
#   c) Delete o id cinco;
#   d) Acrescente uma nova coluna denominada dívida;
#   e) Preencha a nova coluna;
#   f) Realize buscas e filtros na tabela

In [2]:
import numpy as np
import pandas as pd

In [3]:
data = {
    'ano': [2014, 2011, 2012, 2011, 2012, 2013],
    'estado': ['PR', 'SC', 'RS', 'RJ', 'MG', 'SP'],
    'desempenho': [1.5, 10.0, 3.6, 2.4, 2.9, 3.2]
}

In [4]:
data = pd.DataFrame(data, 
                    columns=['ano', 'estado', 'desempenho'], 
                    index= ['um', 'dois', 'três', 'quatro', 'cinco', 'seis'])

In [7]:
print(data)

         ano estado  desempenho
um      2014     PR         1.5
dois    2011     SC        10.0
três    2012     RS         3.6
quatro  2011     RJ         2.4
cinco   2012     MG         2.9
seis    2013     SP         3.2

In [5]:
data

         ano estado  desempenho
um      2014     PR         1.5
dois    2011     SC        10.0
três    2012     RS         3.6
quatro  2011     RJ         2.4
cinco   2012     MG         2.9
seis    2013     SP         3.2

In [6]:
data.drop(['cinco'])

         ano estado  desempenho
um      2014     PR         1.5
dois    2011     SC        10.0
três    2012     RS         3.6
quatro  2011     RJ         2.4
seis    2013     SP         3.2

In [8]:
data['dívida'] = 10

In [9]:
data

         ano estado  desempenho  dívida
um      2014     PR         1.5      10
dois    2011     SC        10.0      10
três    2012     RS         3.6      10
quatro  2011     RJ         2.4      10
cinco   2012     MG         2.9      10
seis    2013     SP         3.2      10

In [11]:
data.loc['dois']

ano           2011
estado          SC
desempenho    10.0
dívida          10
Name: dois, dtype: object